___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna() # row NAN lar gider

     A    B  C
0  1.0  5.0  1

In [7]:
df.dropna(axis = 1)# axis=1 column larda NAN lar gider

   C
0  1
1  2
2  3

In [8]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.mean

<bound method DataFrame.mean of      A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3>

In [10]:
df.fillna(value = "sut")

     A    B  C
0    1    5  1
1    2  sut  2
2  sut  sut  3

In [11]:
df["A"].fillna(value = df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [12]:
df.fillna(value = df["A"].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [13]:
df.fillna(df["C"].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

In [14]:
V1 = np.array([2,3,5,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,13,5,6,13,7,np.NaN,3,30])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}
)
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [15]:
df.isnull()

    Var1   Var2   Var3
0  False  False   True
1  False   True  False
2  False  False  False
3   True  False  False
4  False  False  False
5  False   True  False
6   True   True   True
7  False  False  False
8  False  False  False

In [16]:
df.notnull()

    Var1   Var2   Var3
0   True   True  False
1   True  False   True
2   True   True   True
3  False   True   True
4   True   True   True
5   True  False   True
6  False  False  False
7   True   True   True
8   True   True   True

In [17]:
df.isnull().sum()/len(df)*100

Var1    22.222222
Var2    33.333333
Var3    22.222222
dtype: float64

In [18]:
df.notnull().sum()

Var1    7
Var2    6
Var3    7
dtype: int64

In [19]:
df.notnull().sum().sum()

20

In [20]:
df.isnull().sum()

Var1    2
Var2    3
Var3    2
dtype: int64

In [21]:
df.isnull().sum().sum()

7

In [22]:
df.Var1.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: Var1, dtype: bool

In [23]:
df.Var1[df.Var1.isnull()]# conditional var1 de nan olanlari getir. 3 ve6

3   NaN
6   NaN
Name: Var1, dtype: float64

In [24]:
def df():
    if df(x).isnull()== True
    return 
       False

SyntaxError: invalid syntax (<ipython-input-24-fe2b9077191b>, line 2)

In [25]:
var1 bir tane bile NAN var ise True dondurur yoksa False dondurur.
var2 bir tane bile NAN var ise True dondurur yoksa False dondurur.
var3 bir tane bile NAN var ise True dondurur yoksa False dondurur.

SyntaxError: invalid syntax (<ipython-input-25-0d2784f1fc6b>, line 1)

In [26]:
any(df["Var1"])

True

In [27]:
df.isnull().any() ### sutunda bir tane bile NAN varsa True dondurur.

Var1    True
Var2    True
Var3    True
dtype: bool

In [28]:
df.isnull().any(axis = 1) ## row bazinda NAN varsa bir tane bile olsa True dondurur.

0     True
1     True
2    False
3     True
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [29]:
### transform metodunu kullanmak lazim burda cok hata yapiliyor burada, ayni index olmali burasi onemli.

In [30]:
kosul = df.isnull().any(axis = 1) # burda kosul bir Seri dir.

In [31]:
df[kosul]

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
3   NaN   8.0   6.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN

In [32]:
#fillna dedigimizde NAN a karsilik gelenler dolar bu kosul ile

In [33]:
df[~kosul] ### TERSI KOSUL un demek "~" isareti, yani dolu satirlari getir.

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [34]:
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [35]:
df[(df.Var1.notnull())& (df.Var2.notnull())& (df.Var3.notnull())]

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [36]:
#koseli patantez icerisinde bool un bir seri yolladiginizda icinde 
#TRUE olan degerler sergilenir.

In [37]:
df.dropna(how="all")

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [38]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8]

In [39]:
df.dropna(how="all", axis = 1)

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [40]:
df["delete_me"] = np.nan ### hepsi NAN olan bir sutun olusturduk.
df

   Var1  Var2  Var3  delete_me
0   2.0   8.0   NaN        NaN
1   3.0   NaN  13.0        NaN
2   5.0   5.0   5.0        NaN
3   NaN   8.0   6.0        NaN
4   7.0  11.0  13.0        NaN
5   1.0   NaN   7.0        NaN
6   NaN   NaN   NaN        NaN
7  10.0   2.0   3.0        NaN
8  14.0   3.0  30.0        NaN

In [41]:
df.dropna(axis=1, how = "all", inplace = True)# hepsi NAN olan drop oldu.
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [42]:
# Filling Value

In [43]:
df["Var1"].fillna(0)

0     2.0
1     3.0
2     5.0
3     0.0
4     7.0
5     1.0
6     0.0
7    10.0
8    14.0
Name: Var1, dtype: float64

In [44]:
df["Var1"].fillna(df["Var1"].mean())

0     2.0
1     3.0
2     5.0
3     6.0
4     7.0
5     1.0
6     6.0
7    10.0
8    14.0
Name: Var1, dtype: float64

In [45]:
 #### sutunlari teker teker Var1 mean, Var2mean, Var3mean ile doldyrabilirim

In [46]:
df.apply(lambda x : x.fillna(x.mean()), axis = 0)  
#### TUM SUTUNLARI MEAN ILE DOLDURDUK kodda axis=0 oluyor
####satir bazli calisiyor.

   Var1       Var2  Var3
0   2.0   8.000000  11.0
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [47]:
df.mean()[:] ### Her sutunun mean ini hesapladi.

Var1     6.000000
Var2     6.166667
Var3    11.000000
dtype: float64

In [48]:
df.fillna(df.mean()[:]) # apply ile yaptigimizin aynisi oldu.

   Var1       Var2  Var3
0   2.0   8.000000  11.0
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [49]:
df.mean()["Var1": "Var2"] #bu bana dictionary yapisi saglar Key& Value

Var1    6.000000
Var2    6.166667
dtype: float64

In [50]:
df.fillna({"Var1" :6, "Var2":6.16})  # burda dict olarak Fillna yaptik

   Var1   Var2  Var3
0   2.0   8.00   NaN
1   3.0   6.16  13.0
2   5.0   5.00   5.0
3   6.0   8.00   6.0
4   7.0  11.00  13.0
5   1.0   6.16   7.0
6   6.0   6.16   NaN
7  10.0   2.00   3.0
8  14.0   3.00  30.0

In [51]:
df.fillna(df.mean()["Var1":"Var2"])

   Var1       Var2  Var3
0   2.0   8.000000   NaN
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667   NaN
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [52]:
df.Var3.fillna(df["Var3"].median())  ### df["Var3"].fillna(df["Var3"].median())

0     7.0
1    13.0
2     5.0
3     6.0
4    13.0
5     7.0
6     7.0
7     3.0
8    30.0
Name: Var3, dtype: float64

In [110]:
notnull()

NameError: name 'notnull' is not defined

In [54]:
pd.notna(df)

    Var1   Var2   Var3
0   True   True  False
1   True  False   True
2   True   True   True
3  False   True   True
4   True   True   True
5   True  False   True
6  False  False  False
7   True   True   True
8   True   True   True

In [55]:
df.where(pd.notna(df), df.mean(), axis = 1)

   Var1       Var2  Var3
0   2.0   8.000000  11.0
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [56]:
Var1 = np.array([1,3,6,np.NaN,7,1,9,np.NaN,15])
Var2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
Var3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
Var4 = np.array(["IT","IT","IT","HR","HR","HR","HR","IT","IT"])
df = pd.DataFrame(
        {"salary" : Var1,
         "Var2" : Var2,
         "Var3" : Var3,
         "department" : Var4}
)
df

   salary  Var2  Var3 department
0     1.0   7.0   NaN         IT
1     3.0   NaN  12.0         IT
2     6.0   5.0   5.0         IT
3     NaN   8.0   6.0         HR
4     7.0  12.0  14.0         HR
5     1.0   NaN   7.0         HR
6     9.0   NaN   NaN         HR
7     NaN   2.0   2.0         IT
8    15.0   3.0  31.0         IT

In [57]:
df.groupby("department")["salary"].mean()

department
HR    5.666667
IT    6.250000
Name: salary, dtype: float64

In [58]:
#### EDA DA arabanin register fisrt register yila cevir 2020 den fisrt registeri cikar yeni bir sutun olustur,
### FUTURE e
km ve arabanin yili dogru orantili arabanin yilini yeni bir sutun olarak bul ve olustur.
km fillna yapacaksini ve bunu yasa gore yapin mantikli olan budur.

SyntaxError: invalid syntax (<ipython-input-58-d4bf9ab7db16>, line 3)

In [59]:
df.salary.fillna({0:1, 1:2, 2:3, 3:4, 4:5, 5:6, 6:7, 7:8, 8:9})

0     1.0
1     3.0
2     6.0
3     4.0
4     7.0
5     1.0
6     9.0
7     8.0
8    15.0
Name: salary, dtype: float64

In [60]:
df.groupby("department")["salary"].transform("mean")

0    6.250000
1    6.250000
2    6.250000
3    5.666667
4    5.666667
5    5.666667
6    5.666667
7    6.250000
8    6.250000
Name: salary, dtype: float64

In [63]:
df.groupby("department")["salary"].mean()

department
HR    5.666667
IT    6.250000
Name: salary, dtype: float64

In [65]:
df.salary.fillna(df.groupby("department")["salary"].mean())

0     1.0
1     3.0
2     6.0
3     NaN
4     7.0
5     1.0
6     9.0
7     NaN
8    15.0
Name: salary, dtype: float64

In [62]:
df.salary.fillna(df.groupby("department")["salary"].transform("mean"))

0     1.000000
1     3.000000
2     6.000000
3     5.666667
4     7.000000
5     1.000000
6     9.000000
7     6.250000
8    15.000000
Name: salary, dtype: float64

In [113]:
V1 = np.array([1,3,6,np.NaN,7,1,np.NaN,9,15])
V4 = np.array(["IT",np.nan,"HR","HR","HR","HR",np.nan,"IT","HR"], dtype=object)

df = pd.DataFrame(
        {"salary" : V1,
        "department" : V4}        
)

df

   salary department
0     1.0         IT
1     3.0        NaN
2     6.0         HR
3     NaN         HR
4     7.0         HR
5     1.0         HR
6     NaN        NaN
7     9.0         IT
8    15.0         HR

In [114]:
df["department"].mode()# Ne kadar cok tekrar ediyorsa onunla doldurmak

0    HR
dtype: object

In [116]:
df["department"].mode()[0]

'HR'

In [115]:
df["department"].fillna(df["department"].mode()[0])

0    IT
1    HR
2    HR
3    HR
4    HR
5    HR
6    HR
7    IT
8    HR
Name: department, dtype: object

In [93]:
df.groupby("department")["salary"].transform('mean') ### Bu groupby a gore bir seri olusturduk.

0    6.250000
1    6.250000
2    6.250000
3    5.666667
4    5.666667
5    5.666667
6    5.666667
7    6.250000
8    6.250000
Name: salary, dtype: float64

In [97]:
df["salary"].fillna(df.groupby("department")["salary"].transform('mean')) ### Bu iterable olan seriyi yolluyoruz.

0     1.000000
1     3.000000
2     6.000000
3     5.666667
4     7.000000
5     1.000000
6     9.000000
7     6.250000
8    15.000000
Name: salary, dtype: float64

In [117]:
df["department"].fillna(method = "bfill")

0    IT
1    HR
2    HR
3    HR
4    HR
5    HR
6    IT
7    IT
8    HR
Name: department, dtype: object

In [118]:
df["department"].fillna(method = "ffill")

0    IT
1    IT
2    HR
3    HR
4    HR
5    HR
6    HR
7    IT
8    HR
Name: department, dtype: object

## .fillna

In [119]:
## en cok tekrar eden catagory ile doldurabiliriz

In [120]:
df("department").mode()[0]

TypeError: 'DataFrame' object is not callable

In [67]:
df("department").fillna(df["department"].mode()[0])

TypeError: 'DataFrame' object is not callable

In [68]:
####EDA da bazi kategoruk degisken deki bosluklari en cok tekrar eden oransal olarak doldurmak istiyorum % 40 aA % 20 B % 15 C % 15 D
####data frame in sutunu var her birini kendi oraninda doldurmak istersek method var ne kadar cok tekrar ediyorssa onunla dolduruyor.

In [69]:
df["department"].fillna(method = "bfill") # ffill ileriden basla dolduk bfill geriden basla doldur sirayla doldurur

0    IT
1    IT
2    IT
3    HR
4    HR
5    HR
6    HR
7    IT
8    IT
Name: department, dtype: object

In [71]:
df["department"].fillna(df["department"].mode()[0])

0    IT
1    IT
2    IT
3    HR
4    HR
5    HR
6    HR
7    IT
8    IT
Name: department, dtype: object

In [102]:
df.department.fillna(df.department.mode()[0])

0    IT
1    IT
2    IT
3    HR
4    HR
5    HR
6    HR
7    IT
8    IT
Name: department, dtype: object

In [72]:
#df.farazi.fillna(a, method = "ffill", limit = 200)
#df.farazi.fillna(b, method = "ffill", limit = 100)
#df.farazi.fillna(a, method = "ffill", limit = 100)
#df.farazi.fillna(c, method = "ffill", limit = 100)
#df.farazi.fillna(a, method = "ffill", limit = 100)
#df.farazi.fillna(b, method = "ffill", limit = 100)
#df.farazi.fillna(c, method = "ffill", limit = 200)
#df.farazi.fillna(a, method = "ffill", limit = 100)

In [73]:
df.farazi.fillna(c, method = "ffill", limit = 100)

AttributeError: 'DataFrame' object has no attribute 'farazi'

### Handling with Outliers